package by.adukar.telegrambot.consts;

public class Faculties {
    public static final String FKP = "Факультет компьютерного проектирования (ФКП)\n" +
            "Проектирования и производство программно-управляемых электронных средств 327/283\n" +
            "Моделирование и компьютерное проектирование радиоэлектронных средств 317*/270\n" +
            "Программируемые мобильные системы 337*/265*\n" +
            "Программно-управляемые  электронно-оптические системы 315/237\n" +
            "Медицинская электроника 316*/248\n" +
            "Инженерно-психологическое обеспечение информационных технологий 341*/280*\n" +
            "Электронные системы безопасности 324/262\n" +
            "Информационные системы и технологии (в обеспечении промышленной безопасности) 337*/282\n" +
            "Информационные системы и технологии (в бизнес-менеджменте) 360/291*";

    public static final String FITY = "Факультет информационных технологий и управления (ФИТУ)\n" +
            "Автоматизированные системы обработки информации 347/285*\n" +
            "Искусственный интеллект 342*/289*\n" +
            "Информационные технологии и управление в технических системах 328*/263*\n" +
            "Промышленная электроника 313*/252\n" +
            "Информационные системы и технологии (в игровой индустрии) 361/295*";

    public static final String FRE = "Факультет радиотехники и электроники (ФРЭ)\n" +
            "Микро- и наноэлектронные технологии и системы 297*/242\n" +
            "Нанотехнологии и наноматериалы в электронике 289*/218\n" +
            "Радиотехника (программируемые радиоэлектронные средства) 295*/231\n" +
            "Радиоэлектронная защита информации 301*/217\n" +
            "Электронные и информационно-управляющие системы физических установок 285*\n" +
            "Радиоинформатика 290*/223\n" +
            "Радиоэлектронные системы 285*/202*\n" +
            "Квантовые информационные системы 295*/244";

    public static final String FKSIS = "Факультет компьютерных систем и сетей (ФКСиС)\n" +
            "Вычислительные машины, системы и сети 343*/272*\n" +
            "Программное обеспечение информационных технологий 371/328*\n" +
            "Информатика и технологии программирования 362/310\n" +
            "Электронные вычислительные средства 336/256";

    public static final String FIK = "Факультет инфокоммуникаций (ФИК)\n" +
            "Инфокоммуникационные технологии (системы телекоммуникаций) 308*/258\n" +
            "Инфокоммуникационные технологии (сети инфокоммуникаций) 314*/262\n" +
            "Инфокоммуникационные технологии (системы распределения мультимедийной информации) 322*/261*\n" +
            "Инфокоммуникационные системы (стандартизация, сертификация и контроль параметров) 300*/233\n" +
            "Защита информации в телекоммуникациях 312*/253\n" +
            "Инфокоммуникационные технологии (цифровое телевидение и радиовещание) 306*/250";

    public static final String IEF = "Инженерно-экономический факультет (ИЭФ)\n" +
            "Специальности с инженерным уклоном:\n" +
            "Информационные системы и технологии (в экономике) 337/287*\n" +
            "Информационные системы и технологии (в логистике) 334*/269\n" +
            "Специальности с экономическим уклоном:\n" +
            "Электронный маркетинг 360/305*\n" +
            "Экономика электронного бизнеса 357/269";

    public static final String VF = "Военный факультет (ВФ)\n" +
            "Инфокоммуникационные технологии (системы телекоммуникаций специального назначения) в интересах МО (муж.) 167\n" +
            "Инфокоммуникационные технологии (системы телекоммуникаций специального назначения) в интересах МО (жен.) 280\n" +
            "Инфокоммуникационные технологии (системы телекоммуникаций специального назначения) в интересах ГПК 196\n" +
            "Радиотехника(специальные системы радиолокации и навигации) 147\n" +
            "Вычислительные машины, системы и сети (специального назначения) в интересах МВД 241\n" +
            "Вычислительные машины, системы и сети (специального назначения) в интересах МО 274\n" +
            "Вычислительные машины, системы и сети (специального назначения) в интересах ГПК 282\n";
}
